jameszah/ESP32-CAM-Video-Recorder/vA1/ESPxWebFlMgr.cpp
  //return String(fs / pow(1024, digitGroups)) + " " + units[digitGroups] + " <small>(" + dispIntDotted(fs) + " kB)</small>";
  return String(fs / pow(1024, digitGroups)) + " " + units[digitGroups] ;
}

//*****************************************************************************************************
void ESPxWebFlMgr::fileManagerIndexpage(void) {
  fileManager->send(200, F("text/html"), FPSTR(ESPxWebFlMgrWpindexpage));
  delay(1);
}

//*****************************************************************************************************
void ESPxWebFlMgr::fileManagerJS(void) {
  fileManager->send(200, F("text/javascript"), FPSTR(ESPxWebFlMgrWpjavascript));
  delay(1);
}

//*****************************************************************************************************
void ESPxWebFlMgr::fileManagerCSS(void) {
  fileManager->send(200, F("text/css"), FPSTR(ESPxWebFlMgrWpcss));
  delay(1);
}

//*****************************************************************************************************
String ESPxWebFlMgr::CheckFileNameLengthLimit(String fn) {
  // SPIFFS file name limit. Is there a way to get the max length from SPIFFS/LittleFS?
  //                                      SPIFFS_OBJ_NAME_LEN is spiffs.... but not very clean.
  if (fn.length() > 32) {
    int len = fn.length();
    fn.remove(29);
    fn += String(len);
  }

  return fn;
}

//*****************************************************************************************************
String ESPxWebFlMgr::colorline(int i) {
  if (i % 2 == 0) {
    return "ccu";
  } else {
    return "ccg";
  }
}

//*****************************************************************************************************
boolean ESPxWebFlMgr::allowAccessToThisFile(const String filename) {
  return ! filename.startsWith(_SysFileStartPattern);
}


//*****************************************************************************************************
// jz kludge for switching folders on the sd card
String subdir = "/";

//*****************************************************************************************************
//[make FS from esp8266 and esp32 compatible]**********************************************************
// this is the way MS DOS 3.x (?) did it with Int21 findfirst/findnext/findclose
#ifdef ESP8266
File ESPxWebFlMgr::nextFile(Dir &dir) {
  dir.next();
  return dir.openFile("r");
}
File ESPxWebFlMgr::firstFile(Dir &dir) {
  dir = ESPxWebFlMgr_FileSystem.openDir("/");
  return nextFile(dir);
}
#endif
#ifdef ESP32
#define Dir File
File ESPxWebFlMgr::nextFile(Dir &dir) {
  return dir.openNextFile();
}
File ESPxWebFlMgr::firstFile(Dir &dir) {
  dir = ESPxWebFlMgr_FileSystem.open(subdir, "r"); //jz dir = ESPxWebFlMgr_FileSystem.open("/", "r");
  return nextFile(dir);
}
#endif

//*****************************************************************************************************
void ESPxWebFlMgr::fileManagerFileListInsert(void) {  // must get arg with /i to list that folder
  fileManager->setContentLength(CONTENT_LENGTH_UNKNOWN);
  fileManager->send(200, F("text/html"), String());

  fileManager->sendContent(F("<div class=\"cc\"><div class=\"gc\">"));

  bool gzipperexists = ( (ESPxWebFlMgr_FileSystem.exists("/gzipper.js.gz")) ||
                         (ESPxWebFlMgr_FileSystem.exists("/gzipper.js")) );

  //Serial.println(fileManager->args());
  //Serial.println(fileManager->argName(0));
  //Serial.println(fileManager->arg(0));

  if ( (fileManager->args() == 1) && (fileManager->argName(0) == "subdir") ) {
    subdir =  fileManager->arg(0);
    //Serial.print("Arg: "); Serial.println(fileManager->arg(0));

    /*
      if (fileManager->arg(0) == "/"){
      subdir = "/";
      } else if (subdir == "/") {
      subdir =  fileManager->arg(0);
      } else {
      subdir =  fileManager->arg(0);
      }
      Serial.print("New subdir: "); Serial.println(subdir);
    */
  } else {
    subdir = "/";
  }
  //Serial.print("Final subdir: "); Serial.println(subdir);

  // first file is "go to root"

  String fcd;
  String direct = "ccd";   //jz bland color for directory
  String fn = "/";
  fcd = "<div "
        "class=\"ccl " + direct + "\""
        "onclick=\"opendirectory('" + fn + "')\""
        ">&nbsp;&nbsp;" + fn + " - GOTO ROOT DIR -" + "</div>";
  fcd += "<div class=\"ccz " + direct + "\">&nbsp;" + " "  + "&nbsp;</div>";
  fcd += "<div class=\"cct " + direct + "\">&nbsp;" + dispIntDotted(0) + "&nbsp;</div>";
  fcd += "<div class=\"ccr " + direct + "\">&nbsp;";
  fcd += "&nbsp;&nbsp;</div>";

  fileManager->sendContent(fcd);


  // List files
  int i = 0;
  Dir dir;
  File file = firstFile(dir);
  while (file) {
    String fn = file.name();
    /*
      Serial.print("FN: >");
      Serial.print(fn);
      Serial.print("<");
      Serial.println();
    */
    if ( (_ViewSysFiles) || (allowAccessToThisFile(fn)) ) {
      /*
        String fc = "<div id=\"file"+String(i)+"\" "
                  "data-filename=\""+fn+"\""
                  "class=\"ccl " + colorline(i) + "\""
                  "onclick=\"downloadfile('" + fn + "')\""
                  ">&nbsp;&nbsp;" + fn + "</div>";
      */

      String fc;
      String nsd;
      if (subdir == "/") {
        nsd = "/";
      } else {
        nsd = subdir + "/";
      }
      if (file.isDirectory()) {
        String direct = "ccd";   //jz bland color for directory
        fc = "<div "
             "class=\"ccl " + direct + "\""
             "onclick=\"opendirectory('" + nsd  + fn + "')\""
             ">&nbsp;&nbsp;" + fn + " - DIR -" + "</div>";

      } else {
        //Serial.println(subdir);
        //Serial.println(fn);
        fc = "<div "
             "class=\"ccl " + colorline(i) + "\""
             "onclick=\"downloadfile('" + nsd + fn + "')\""
             ">&nbsp;&nbsp;" + fn + "</div>";
      }

      time_t t= file.getLastWrite();
      struct tm * tmstruct = localtime(&t);
      //Serial.printf("  LAST WRITE: %d-%02d-%02d %02d:%02d:%02d\n",(tmstruct->tm_year)+1900,( tmstruct->tm_mon)+1, tmstruct->tm_mday,tmstruct->tm_hour , tmstruct->tm_min, tmstruct->tm_sec);
      char ccz[100];
      sprintf(ccz, " %d-%02d-%02d %02d:%02d:%02d\n",(tmstruct->tm_year)+1900,( tmstruct->tm_mon)+1, tmstruct->tm_mday,tmstruct->tm_hour , tmstruct->tm_min, tmstruct->tm_sec);
      

      fc += "<div class=\"ccz " + colorline(i) + "\">&nbsp;" + String(ccz) + "&nbsp;</div>"; //jz

